#USE movies_db;
INSERT INTO reviews (user_id, movie_id, rank, comment) 
VALUES (1, 1, 10, 'Братство кольца - это отличная экранизация романа Толкиена о борьбе добра и зла.
Фильм снят достаточно близко к литературному варианту. Мне очень понравился фильм, как и вся серия \'Властелин колец\'.');
INSERT INTO reviews (user_id, movie_id, rank, comment) 
VALUES (1, 4, 10, 'Фильмы серии \'Хоббит\' меня поразили качеством и масшабностью съёмок, несмотря на некоторые расхождения 
в событиях фильмы и книги, всё равно фильм отличный и заслуживает высокой оценки.');